{"title":"为什么要开通个人博客？","date":"2019-04-20T05:00:31.000Z","thumbnail":"https://cdn.sinaimg.cn.52ecy.cn/large/005BYqpgly1g37uofckrsj33i80u0u10.jpg","color":"#111","slug":"为什么开通个人博客","tags":["思考"],"updated":"2019-06-06T04:05:44.365Z","content":"<blockquote>\n<p>“我一直是个没什么真实感的人。很多时候，我“知道”我当下身在此地，所作何事，但我缺乏真正的、深刻的“感受”——确确实实 的感到自己和身边的事物在深刻地连结。“写作”或许就是这一问题的解药。”</p>\n</blockquote>\n<h2 id=\"1-为什么开通个人博客\">1.为什么开通个人博客<a href=\"post/为什么开通个人博客#1-为什么开通个人博客\"></a></h2><p>​        作为一个还算是喜欢折腾的人，很早之前就想搭建一个个人网站，能在广阔的互联网世界有自己的一亩二分地，心里还是挺开心的。大概上大二的时候，开始自学web前端的一些技术，想自己写代码堆出来一个网站，期间因为各种大大小小的事情，没有继续坚持下去，网站也就不了了之了。后来，考上了交互设计专业的研究生，几次试着重新开始学习web开发，但还是以遗憾告终。经历了断断续续学习技术的这几年，我发现一个道理：做事情一定要目标导向。百度搜索“小白如何开发个人博客”，会搜到几十种相关的文章教程。既然有这么多问题的解法，干嘛非得从底层开始学习网站开发呢？（不过，技术是作为互联网从业者必须去了解的知识，学习是应该的）。懂得这一道理以后，不到一个礼拜，这个博客就诞生了……所以我这些年断断续续学习技术所花的精力在“搭建个博客”上面几乎是是没有发挥作用。如今的这个博客是基于hexo+github搭建的，9块钱买了个域名，心里美滋滋。</p>\n<p>​        回到“为什么开通个人博客”这个问题上。首先第一点，前面也提到了，我是一个喜欢折腾的人，崇拜极客精神。对于我而言，“个人网站”比“个人公众号”高级的多！虽然在读者触达上，“个人网站”要吃亏一些，但是<strong>酷</strong>最重要。第二点，<strong>锻炼习作能力</strong>。读了几本书以及结合实习工作的体会之后，越发觉得写作的重要性，写作是锻炼表达能力、思维能力的重要手段。冰山之上是语言表达能力，冰山之下是分析能力、逻辑思维、观察能力和情商的综合体现。我希望这博客可以激励我多思考，多下笔，提高自己的各项能力。第三点，<strong>记录平时的思考</strong>。日常思考的问题，通过文字来落地是最好不过了，希望这个博客可以促进我多思考，多记录。第四点，<strong>培养自己的认知能力</strong>。《学会提问》讲到一种思维方式：海绵式思维，拥有这种思维方式的人喜欢被动的去接受外界的信息，对获取的信息全盘接受，没有辩证取舍的能力。这思维我自认为是很可怕的，尤其在现在这种信息爆炸的时代，我们很容易被卷进别人的思想之中。开通博客的一个重要目的，就是培养“淘金式思维”，形成自己的价值观和方法论。</p>\n<p>​        总而言之，创建个人博客的最终目的可以归结为<strong>成长</strong>。希望这个地方可以成为帮助我成长的重要一环。</p>\n<h2 id=\"2-以后会写些什么\">2.以后会写些什么<a href=\"post/为什么开通个人博客#2-以后会写些什么\"></a></h2><p>​        开通这个博客更多的是给自己看，具体写些什么东西还不确定，我认为在开始这个阶段，重要的不是内容产出的质量，而是养成“写博客”的习惯。其一，会记录一些平时学习、工作的总结和思考（只要有内容，思考产出都放在这个网站）；其二，有可能会坚持写日记，但是日记毕竟是一种私密的东西，不适合放在互联网上（待定，考虑是否更改日记的内容形式）；其三，放些生活。大概我有一年左右没有发过朋友圈了，社交压力是主要的原因。希望这里可以是记录生活的地方。</p>\n<h2 id=\"3-许愿\">3.许愿<a href=\"post/为什么开通个人博客#3-许愿\"></a></h2><p>​        距离步入职场的时刻越来越近。我愿，时光的印记可以更深刻一些， 自己的肩膀可以更强壮一些。</p>\n<div class=\"article-img\"><p><img src=\"https://cdn.sinaimg.cn.52ecy.cn/large/005BYqpgly1g33bhkoeysj31ay04mq3n.jpg\" alt=\"未标题-1 拷贝\" data-zoomable></p></div>\n","prev":{"title":"对滴滴一个设计细节的思考","slug":"对滴滴一个设计细节的思考"},"link":"https://hardwell.top/post/为什么开通个人博客/","toc":[{"title":"1.为什么开通个人博客","id":"1-为什么开通个人博客","index":"1"},{"title":"2.以后会写些什么","id":"2-以后会写些什么","index":"2"},{"title":"3.许愿","id":"3-许愿","index":"3"}]}