{"title":"对滴滴一个设计细节的思考","date":"2019-05-15T02:00:31.000Z","thumbnail":"https://cdn.sinaimg.cn.52ecy.cn/large/005BYqpgly1g37uqveo3hj32nl0mqx6p.jpg","color":"#111","slug":"对滴滴一个设计细节的思考","tags":["思考","设计"],"updated":"2019-05-20T08:22:14.280Z","content":"<p>​        </p>\n<p>​        滴滴作为国内一线的互联网公司，已经有了近5年的历史，对于这样一家巨头公司，他的各项产品与服务都是相对比较成熟的。各项产品功能想必都是经过充分论证的。前些天我对滴滴打车的整个流程重新认真体验了一番，从叫车到下车完成评价。在这整个过程中，发现一个很有意思的设计细节，可以拿出来跟列为看官讨论一番。</p>\n<div class=\"article-img\"><p><img src=\"https://cdn.sinaimg.cn.52ecy.cn/large/005BYqpgly1g37tkpf7fvj30pp0djn1a.jpg\" alt=\"Bitmap\" data-zoomable></p></div>\n<p>​            如果用户在叫车之后，由于某种原因希望取消订单，需要经历以上四个步骤。到达第二步，点击「确认取消」后，订单就算是取消成功了，司机端会接收到订单取消的通知，整个订单生命周期结束。所以后边的填写行程取消原因，不是用户必要行为，用户可填可不填。整个过程我认为是合理的，问题出在界面设计上。我简单的做了一个小范围的调研，询问了5个经常使用滴滴打车的同学。5个同学一致认为只有提交完「行程取消原因」之后，订单才算结束。 为什么会有这样的结果呢？</p>\n<p>​        考虑一下当时的场景，当我们叫车之后由于某种原因取消订单时， 心里肯定是非常着急的。如果是自己的责任，心里肯定会有个暗示：我再不赶紧取消，这单子就取消不了吧。如果是司机的责任，心里肯定很不爽，耽误这么多时间赶紧找下一辆车吧。所以在这中焦急的心态下，我们看到的东西，只可能是一眼就能注意的东西。回到上图第三个界面，这张图取消原因占到80%的空间，「行程取消成功」低调得没人能注意到她…就算提交完原因到第四步的时候，仍没有一个足够醒目的符号来向用户传达「行程取消成功」这一信息。我在花瓣网搜索关键字「提交成功」，得到的全是下面的图。所以，一个正常的「提交成功」界面=醒目的icon+充足的提示空间。</p>\n<p>​        我们说，作为一个成熟的商业公司，产品的每个功能设计都是经过充分验证且带有目的性的。所以滴滴这样设计应该是有其考虑的。我认为一个很重要的原因，设计师故意将其「行程取消成功」的信息做的弱一些，可以使用户误以为订单还未完成，促使用户完成退单原因的勾选和提交，从而提高「取消原因」数据的的数量和质量。这部分数据对于公司运营来说是具备巨大价值的，是服务质量的晴雨表。通过对这部分数据的分析，可以从平台、司机、乘客等各端分析用户退单的原因，举个例子，如果是因为司机迟到导致客户的退单，平台可以对司机迟到行为加以处罚，点对点的改善司机的服务。所以，对这些数据分析与处理，可以大大减少退单率，提高成交量，这对公司服务质量的提高是非常有益的。</p>\n<div class=\"article-img\"><p><img src=\"https://cdn.sinaimg.cn.52ecy.cn/large/005BYqpgly1g37tl3r32dj30mh0aqn1e.jpg\" alt=\"Bitmap 2\" data-zoomable></p></div>\n<p>​        当然，上面的讨论只是猜测，至于为什么这样设计，以及这样设计所带来的收益，只有滴滴的同学自己知道，我们只是通过对产品的体验，去洞察某个功能的设计目的。我认为完成业务目标的手段有很多种，但牺牲用户体验来达到目的的方法是下下策。问题来了，如果交给我来做这个功能会怎么做？话不多说……下面就是我的redisign。其实这个界面归根结底就是要解决两个问题。1.准确传达「行程取消成功」的信息；2.引导用户提交高质量的「行程取消原因」。试想，用户在焦急状态下填写的表单质量是很难得到保证的。我在设计的过程中对界面进行了重构，首先将「行程取消成功」做的更加凸显，成为该界面的第一视觉层级，确保用户知道订单已经取消成功了，让用户放心。其次，将原因表单信息由竖向结构改成了横向结构，单页信息更加的清晰且有条理，主次分明，更好的引导用户完成表单的填写。<img src=\"https://cdn.sinaimg.cn.52ecy.cn/large/005BYqpgly1g37tlf9tuij31560m2q8y.jpg\" alt=\"image-20190519225807549\"></p>\n<p>​        不敢保证我的设计能同时解决上面两个问题，还需要实际上线后数据指标的支撑。例如表单的提交率，填写表单时长，以及表单内容质量指标等，来综合考量是否能实现设计的目标。总而言之吧，产品设计是一种脑力工作，需要理性的思考推理，也需要对用户对、场景的深刻理解，好的设计是禁得起推敲的，同时也是对用户极度友好的。愿我们在追逐各项指标的同时，不要忘了我们的用户。</p>\n<div class=\"article-img\"><p><img src=\"https://cdn.sinaimg.cn.52ecy.cn/large/005BYqpgly1g33bhkoeysj31ay04mq3n.jpg\" alt=\"未标题-1 拷贝\" data-zoomable></p></div>\n","prev":{"title":"我的产品经理逻辑能力训练（1）","slug":"我的产品经理逻辑能力训练（1）"},"next":{"title":"为什么要开通个人博客？","slug":"为什么开通个人博客"},"link":"https://hardwell.top/post/对滴滴一个设计细节的思考/"}